# Taps
tap "borkdude/brew"
tap "harelba/q"
tap "homebrew/bundle"
tap "d12frosted/emacs-plus"
tap "hashicorp/tap"


# Brew installs
brew "chezmoi"
brew "coreutils"
brew "cmake"
brew "curl"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "just"
brew "nushell"
brew "yazi"         # Terminal file manager
brew "ripgrep"
brew "tmux"
brew "starship"     # Shell prompt
brew "zellij"       # Terminal multiplexer
brew "wget"
brew "difftastic"   # Structural code diffs
brew "git-delta"    # Even fancier structural code diffs
brew "htop"         # Process manager
brew "tree"         # Tree view of the current directory
brew "jj"           # Jujutsu version control system
brew "gpg"          # Signing things
brew "fd"
brew "bat"          # cat, but cool
brew "eza"          # ls, but cool
brew "fd"           # find, but cool
brew "watch"        # Periodically execute commands
brew "helix"        # Editor
brew "nvim"         # Editor
brew "fastfetch"    # Neofetch, shows system info

# Toolchain management
brew "rustup-init"  # Rust
brew "mise"         # Toolchain management
brew "pipx"         # Pyhton apps

# Kubernetes
brew "krew"
brew "kubernetes-cli"
brew "helm"
brew "k9s"
brew "stern"

{{- if eq .location "work" }}
## Work installs

### JS
brew "yarn"

### Python
brew "pyenv"
brew "uv"

brew "awscli"
brew "argocd"
brew "xsv"
brew "hadolint"
brew "tfenv"
brew "tflint"
brew "shellcheck"     # Linter for shell files
brew "socat"          # Netcat like network manipulation thingy
{{- end }}

{{- if eq .location "home" }}
## Home installs
brew "syncthing"
brew "opus-tools"
brew "yt-dlp"
brew "imagemagick"
brew "hledger"              # Plain text accounting
brew "typst"                # Type setting app like LaTeX
brew "uv"                   # Python package manager
brew "zig"
{{- end }}

# Casks
cask "docker-desktop"
cask "iterm2"
cask "raycast"
cask "mac-mouse-fix@2"
cask "postman"
cask "bitwarden"
cask "obsidian"             # Note taking app
cask "neovide-app"          # Neovim GUI
cask "spotify"              # Music
cask "beekeeper-studio"     # SQL explorer
cask "alacritty"            # Terminal emulator
cask "wezterm"              # Terminal emulator
cask "zen"                  # Firefox fork browser
cask "ukelele"              # Custom keyboard layouts on macOS

{{- if eq .location "work" }}
## Work Casks
cask "google-cloud-sdk"
cask "hashicorp/tap/hashicorp-vagrant"  # Virtual Machines go brrrr
cask "parallels"                        # Windows Virtual Machines go brrrrr
cask "google-drive"                     # Sync those obsidian notes
{{- end }}

{{- if eq .location "home" }}
## Home Casks
cask "calibre"
cask "musicbrainz-picard"   # Music tagger and organiser
cask "audacity"
cask "lastfm"
cask "zed"                  # Editor
cask "paragon-ntfs"         # Support for NTFS external hdds on MacOS
cask "burn"                 # CD/DVD Burner
cask "ente-auth"            # 2FA
cask "balenaetcher"         # Bootable pendrive ISO writer
cask "jetbrains-toolbox"
cask "zotero"               # Citation and reference manager
cask "anki"                 # Flashcard app
cask "backuploupe"          # Time Machine backup debug/browser
# TODO: Change this to non-beta, after a release which works on macos26 tahoe
cask "jordanbaird-ice@beta" # MacOS status bar hide icons
{{- end }}

{{- if eq .location "home" }}
## NTFS support for macOS
tap "gromgit/fuse"

cask "macfuse"
brew "gromgit/fuse/ntfs-3g-mac"
cask "mounty"
{{- end }}

{{- if eq .location "work" }}
## Axoflow
tap "garden-io/garden"

brew "minikube"   # Local mini kubernetes
brew "rsync"      # rsync 3.1+ is not installed on macos by default
brew "step"
cask "google-cloud-sdk"
brew "garden-io/garden/garden-cli"

{{- end }}
