# Taps
tap "borkdude/brew"
tap "harelba/q"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "oven-sh/bun"
{{- if eq .location "work" }}
tap "wp/inf", "git@github.dev.pages:infrastructure/homebrew-wp-inf.git"
{{- end }}


# Brew installs
brew "bun"        # Javascript runtime, Node.JS alternative
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "just"
brew "neovide"
brew "nushell"
brew "lf"           # Terminal file manager
brew "ripgrep"
brew "tmux"
brew "starship"     # Shell prompt
brew "zellij"       # Terminal multiplexer
brew "wget"

# Toolchain management
brew "rustup-init"  # Rust
brew "asdf"         # Python
brew "pipx"         # Pyhton apps

# Kubernetes
brew "krew"
brew "kubernetes-cli"
brew "helm"
brew "k9s"

{{- if eq .location "work" }}
## Work installs
brew "wp/inf/kubectl-import"

brew "awscli"
brew "argocd"
brew "lastpass-cli"
brew "clojure"
brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "jmeter"
brew "redis"
brew "sops"
brew "chronograf"
brew "openldap"
brew "p7zip"
brew "xsv"
brew "yarn"
brew "harelba/q/q"
brew "k6"
brew "expect"
brew "hadolint"
brew "gnu-getopt"
brew "ghostscript"
brew "git-crypt"
brew "git-delta"
brew "pandoc"
brew "stern"
brew "tig"
brew "Virtuslab/scala-cli/scala-cli"
brew "tfenv"
brew "tflint"
brew "checkov"
brew "pre-commit"
brew "prometheus"
{{- end }}

{{- if eq .location "home" }}
## Home installs
brew "go"
brew "syncthing"
{{- end }}

# Casks
cask "docker"
cask "iterm2"
cask "jetbrains-toolbox"
cask "raycast"
cask "mac-mouse-fix"
cask "postman"
cask "dash"                 # Documentation browser
cask "obsidian"             # Note taking app
cask "orion"                # WebKit based web browser

{{- if eq .location "home" }}
## Home Casks
# cask "calibre"
cask "musicbrainz-picard"
cask "audacity"
{{- end }}
